app/Controllers/Register.php

    public function create()
    {
        $payload = [
            "name" => $this->request->getPost('name'),
            "email" => $this->request->getPost('email'),
            "password" => md5($this->request->getPost('password')),
        ];

        $this->userModel->insert($payload);
---
INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Mutiara', 'mutiara@gmail.com', '0a113ef6b61820daa5611c870ed8d5ee')